#კომენტარების სახით ახსენით რას აკეთებს .split() და .join() ფუნქციები.




# .split()  
# ----------------------------------
# გამოიყენება სტრიქონის დასაყოფად ნაწილებად (სიის ელემენტებად).  
# იგი იღებს არგუმენტად "გამყოფს" (separator), რომლის მიხედვითაც დაშლის სტრიქონს.  
# თუ გამყოფი არ გადაეცემა, სტრიქონი დაიყოფა space-ების მიხედვით.  

# მაგალითი:
text = "გამარჯობა როგორ ხარ"
parts = text.split(" ")  
# შედეგი იქნება: ["გამარჯობა", "როგორ", "ხარ"]


# .join()  
# ----------------------------------
# გამოიყენება სიის ელემენტების "ერთ სტრიქონად" გასაერთიანებლად.  
# მას წინ უნდა დავუწეროთ გამყოფი (separator), რომლითაც ელემენტები შეერთდება.  

# მაგალითი:
words = ["გამარჯობა", "როგორ", "ხარ"]
sentence = " ".join(words)  
# შედეგი იქნება: "გამარჯობა როგორ ხარ"