#კომენტარებით ახსენით რა არის სია და როგორ უნდა შევქმნათ ის(მოიყვანეთ მაგალითით შექმენით ნებისმიერი სია)


# რა არის სია სია (ინგლისურად: List) პროგრამირებაში წარმოადგენს მონაცემთა სტრუქტურას, რომელიც საშუალებას გვაძლევს ერთ სივრცეში შევინახოთ მრავალი ელემენტი (მაგალითად, რიცხვები, სიტყვები, ობიექტები და სხვა). სიაშიელემენტებს აქვთ თანმიმდევრობა და თითოეულ მათგანს შეიძლება მივწვდეთ ინდექსის (ნომრის) საშუალებით.



#მაგალითი

fruits = ["ვაშლი", "ბანანი", "ატამი", "მსხალი"]
print(fruits[0])
print(len(fruits))
fruits.append("ფორთოხალი")
print(fruits)