#3) კომენტარებით ახსენით თუ რა არის snake_case და რისთვის გამოიყენება ის. მოიყვანეთ მაგალითები

#snake_case არის სახელდების სტილი რომელიც გამოიყენება ცვლადების, ფუნქციების ფაილების და კიდევ ბევრი ობიექტების დასახელებისტვის პროგრამირებაში.ამ სტილში სიტყვებიგამოიყენება ქვედა ტირეს _ გამოყენებით.
#sanke_case ხშირად გამოიყენება სხვადასხვა პროგრამკოდის წაკიტხვის პროგრამირების ენებში ცვლადების და ფუნქციების სახელდებისთვის განსაკუთრებით pyton,PHP,ruby და სხვა ენებში სადაც ეს სტილი რეკომენდირებულია კოდის წაკიტხვის გასაუმჯობესებლად
#მაგალითად
my_name="giorgi"
my_hight=1.66