# 1)განიხილეთ ეს კოდი (რას გამოიტანს):

# name = "vano"
# age = 0
# # print(name + "best")

# -------------------------------
# 2)კომენტარის გამოყენებით ახსენით რა არის კომენტარი + რისთვის გამოიყენება ის ასევე ახსენით რა არის დებაგიგნი

# -------------------------------
# 3)რა არის ამ კოდში შეცდომა (რომელ ხაზზე)

# name = "vano"
# surname = motiashvili
# height = 1 86
# print(name + surname - height)



# 1) name "vano" გამოიტანს "vanos" age = 0 არაფერს გამოიტანს print(name + "best") გამოიტანს ვანო არის საუკეთესო
# 2) კომენტარი არის დაფარული ტექსტი რომელიც ეხმარება ადამიანს გაიგოს კოდების აზრი დებაგინი არის არასწორი ტექსტის გამოსწორება
# 3) 

name= "vano"
surname= mothiashvili #აქ შეცდომაა ბრჭყალები არ უწერია
hight= 1 86 # აქაც შეცდომაა სფეისია
print(name+surname+hight) #აქაც შეცდომაა არ გამშვა იმიტომ რომსხვებიც არასწორია ზევიტ