#კომენტარებით ახსენით თუ რა არის custom ფუნქციები, რისთვის გამოვიყენებთ და რა დანიშნულება გააჩნიათ, ასევე ახსენით მისი შექმნის გზები ეტაპობრივად და ახსენეთ თუ რაა პარამეტრები და არგუმენტები.





#Custom ფუნქცია (ასევე ეწოდება "საკუთარი დაწერილი ფუნქცია") — ეს არის პროგრამისტის მიერ შექმნილი კოდის ბლოკი,
#  რომელსაც შეუძლია განსაზღვრული მოქმედებების შესრულება.
# ფუნქციები ეხმარება პროგრამისტს კოდის ორგანიზებასა და გამეორებითი მოქმედებების თავიდან აცილებაში.

def say_hello():
    print("გამარჯობა!") 